<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Documentation" data-toc-modified-id="Documentation-1">Documentation</a></span></li><li><span><a href="#Intro-to-Pandas" data-toc-modified-id="Intro-to-Pandas-2">Intro to Pandas</a></span><ul class="toc-item"><li><span><a href="#Pandas-Data-Structures" data-toc-modified-id="Pandas-Data-Structures-2.1">Pandas Data Structures</a></span><ul class="toc-item"><li><span><a href="#pd.Series-and-pd.DataFrame" data-toc-modified-id="pd.Series-and-pd.DataFrame-2.1.1"><code>pd.Series</code> and <code>pd.DataFrame</code></a></span></li></ul></li><li><span><a href="#Why-Pandas" data-toc-modified-id="Why-Pandas-2.2">Why Pandas</a></span></li></ul></li><li><span><a href="#Pandas-Series" data-toc-modified-id="Pandas-Series-3">Pandas Series</a></span><ul class="toc-item"><li><span><a href="#Create-a-Pandas-Series" data-toc-modified-id="Create-a-Pandas-Series-3.1">Create a Pandas Series</a></span><ul class="toc-item"><li><span><a href="#pd.Series(data,-index)" data-toc-modified-id="pd.Series(data,-index)-3.1.1"><code>pd.Series(data, index)</code></a></span></li><li><span><a href="#Attributes-of-a-pd.Series" data-toc-modified-id="Attributes-of-a-pd.Series-3.1.2">Attributes of a <code>pd.Series</code></a></span></li></ul></li><li><span><a href="#Accessing-Elements" data-toc-modified-id="Accessing-Elements-3.2">Accessing Elements</a></span><ul class="toc-item"><li><span><a href="#By-Labelled-Index" data-toc-modified-id="By-Labelled-Index-3.2.1">By Labelled Index</a></span></li><li><span><a href="#By-Numeric-Index" data-toc-modified-id="By-Numeric-Index-3.2.2">By Numeric Index</a></span></li><li><span><a href="#.loc-and-.iloc" data-toc-modified-id=".loc-and-.iloc-3.2.3"><code>.loc</code> and <code>.iloc</code></a></span></li></ul></li><li><span><a href="#Modifying-an-element" data-toc-modified-id="Modifying-an-element-3.3">Modifying an element</a></span></li><li><span><a href="#Delete-an-element---pd.Series.drop" data-toc-modified-id="Delete-an-element---pd.Series.drop-3.4">Delete an element - <code>pd.Series.drop</code></a></span></li><li><span><a href="#Arithmetic-Operations" data-toc-modified-id="Arithmetic-Operations-3.5">Arithmetic Operations</a></span><ul class="toc-item"><li><span><a href="#Using-arithmetic-symbols" data-toc-modified-id="Using-arithmetic-symbols-3.5.1">Using arithmetic symbols</a></span></li><li><span><a href="#Use-Numpy-math-functions" data-toc-modified-id="Use-Numpy-math-functions-3.5.2">Use <code>Numpy</code> math functions</a></span></li></ul></li></ul></li><li><span><a href="#DataFrames" data-toc-modified-id="DataFrames-4">DataFrames</a></span><ul class="toc-item"><li><span><a href="#Create-DataFrames---pd.DataFrame()" data-toc-modified-id="Create-DataFrames---pd.DataFrame()-4.1">Create DataFrames - <code>pd.DataFrame()</code></a></span><ul class="toc-item"><li><span><a href="#From-a-dictionary" data-toc-modified-id="From-a-dictionary-4.1.1">From a dictionary</a></span><ul class="toc-item"><li><span><a href="#Using-a-Dict-of-Panda-Series-with-Labelled-Index" data-toc-modified-id="Using-a-Dict-of-Panda-Series-with-Labelled-Index-4.1.1.1">Using a Dict of Panda Series with Labelled Index</a></span></li><li><span><a href="#Using-a-Dict-of-Pandas-Series-without-Labelled-Index" data-toc-modified-id="Using-a-Dict-of-Pandas-Series-without-Labelled-Index-4.1.1.2">Using a Dict of Pandas Series without Labelled Index</a></span></li><li><span><a href="#Using-a-Dict-of-lists-without-row-index-provided" data-toc-modified-id="Using-a-Dict-of-lists-without-row-index-provided-4.1.1.3">Using a Dict of lists without row <code>index</code> provided</a></span></li><li><span><a href="#Using-a-Dict-of-list-with-row-index-provided" data-toc-modified-id="Using-a-Dict-of-list-with-row-index-provided-4.1.1.4">Using a Dict of list with row <code>index</code> provided</a></span></li></ul></li><li><span><a href="#From-a-List-of-Dicts" data-toc-modified-id="From-a-List-of-Dicts-4.1.2">From a List of Dicts</a></span></li><li><span><a href="#From-Numpy-ndarrays" data-toc-modified-id="From-Numpy-ndarrays-4.1.3">From Numpy ndarrays</a></span></li></ul></li><li><span><a href="#Attributes-of-DataFrame" data-toc-modified-id="Attributes-of-DataFrame-4.2">Attributes of DataFrame</a></span></li><li><span><a href="#Create-a-DataFrame-with-Subset-of-Data" data-toc-modified-id="Create-a-DataFrame-with-Subset-of-Data-4.3">Create a DataFrame with Subset of Data</a></span><ul class="toc-item"><li><span><a href="#Subset-with-columns" data-toc-modified-id="Subset-with-columns-4.3.1">Subset with <code>columns</code></a></span></li><li><span><a href="#Subset-with-index-(rows)" data-toc-modified-id="Subset-with-index-(rows)-4.3.2">Subset with <code>index</code> (rows)</a></span></li><li><span><a href="#Subset-with-both-columns-and-index" data-toc-modified-id="Subset-with-both-columns-and-index-4.3.3">Subset with both <code>columns</code> and <code>index</code></a></span></li></ul></li><li><span><a href="#Accessing-Elements" data-toc-modified-id="Accessing-Elements-4.4">Accessing Elements</a></span><ul class="toc-item"><li><span><a href="#Using-row-labels" data-toc-modified-id="Using-row-labels-4.4.1">Using row labels</a></span></li><li><span><a href="#Using-column-labels" data-toc-modified-id="Using-column-labels-4.4.2">Using column labels</a></span></li><li><span><a href="#Using-row-and-column-labels" data-toc-modified-id="Using-row-and-column-labels-4.4.3">Using row and column labels</a></span></li></ul></li><li><span><a href="#Adding-Columns-and-Rows" data-toc-modified-id="Adding-Columns-and-Rows-4.5">Adding Columns and Rows</a></span><ul class="toc-item"><li><span><a href="#Adding-Columns" data-toc-modified-id="Adding-Columns-4.5.1">Adding Columns</a></span><ul class="toc-item"><li><span><a href="#Using-df[new_col]" data-toc-modified-id="Using-df[new_col]-4.5.1.1">Using <code>df[new_col]</code></a></span></li><li><span><a href="#Using-df.insert" data-toc-modified-id="Using-df.insert-4.5.1.2">Using <code>df.insert</code></a></span></li></ul></li><li><span><a href="#Adding-Rows" data-toc-modified-id="Adding-Rows-4.5.2">Adding Rows</a></span><ul class="toc-item"><li><span><a href="#Use-df.append" data-toc-modified-id="Use-df.append-4.5.2.1">Use <code>df.append</code></a></span></li><li><span><a href="#Use-df.loc-to-assign-a-new-row-of-data" data-toc-modified-id="Use-df.loc-to-assign-a-new-row-of-data-4.5.2.2">Use <code>df.loc</code> to assign a new row of data</a></span></li></ul></li></ul></li><li><span><a href="#Deleting-Columns-and-Rows" data-toc-modified-id="Deleting-Columns-and-Rows-4.6">Deleting Columns and Rows</a></span><ul class="toc-item"><li><span><a href="#df.pop-to-delete-columns" data-toc-modified-id="df.pop-to-delete-columns-4.6.1"><code>df.pop</code> to delete columns</a></span></li><li><span><a href="#df.drop-to-delete-both-columns-and-rows" data-toc-modified-id="df.drop-to-delete-both-columns-and-rows-4.6.2"><code>df.drop</code> to delete both columns and rows</a></span></li></ul></li><li><span><a href="#Rename-Rows-and-Columns" data-toc-modified-id="Rename-Rows-and-Columns-4.7">Rename Rows and Columns</a></span><ul class="toc-item"><li><span><a href="#df.rename" data-toc-modified-id="df.rename-4.7.1"><code>df.rename</code></a></span><ul class="toc-item"><li><span><a href="#df.set_index---set-the-row-index-with-data-of-a-column" data-toc-modified-id="df.set_index---set-the-row-index-with-data-of-a-column-4.7.1.1"><code>df.set_index</code> - set the row index with data of a column</a></span></li></ul></li></ul></li></ul></li><li><span><a href="#Dealing-with-NaN" data-toc-modified-id="Dealing-with-NaN-5">Dealing with <code>NaN</code></a></span><ul class="toc-item"><li><span><a href="#Visualize-NaN" data-toc-modified-id="Visualize-NaN-5.1">Visualize <code>NaN</code></a></span><ul class="toc-item"><li><span><a href="#df.isnull" data-toc-modified-id="df.isnull-5.1.1"><code>df.isnull</code></a></span></li><li><span><a href="#df.count---do-the-opposite" data-toc-modified-id="df.count---do-the-opposite-5.1.2"><code>df.count</code> - do the opposite</a></span></li></ul></li><li><span><a href="#Remove-NaN" data-toc-modified-id="Remove-NaN-5.2">Remove <code>NaN</code></a></span><ul class="toc-item"><li><span><a href="#df.dropna" data-toc-modified-id="df.dropna-5.2.1"><code>df.dropna</code></a></span></li></ul></li><li><span><a href="#Replace-NaN" data-toc-modified-id="Replace-NaN-5.3">Replace <code>NaN</code></a></span><ul class="toc-item"><li><span><a href="#df.fillna" data-toc-modified-id="df.fillna-5.3.1"><code>df.fillna</code></a></span></li><li><span><a href="#df.interpolate" data-toc-modified-id="df.interpolate-5.3.2"><code>df.interpolate</code></a></span></li></ul></li><li><span><a href="#Quiz---Create-and-Clean-a-DataFrame" data-toc-modified-id="Quiz---Create-and-Clean-a-DataFrame-5.4">Quiz - Create and Clean a DataFrame</a></span></li></ul></li><li><span><a href="#Loading-Data-into-DataFrame" data-toc-modified-id="Loading-Data-into-DataFrame-6">Loading Data into DataFrame</a></span><ul class="toc-item"><li><span><a href="#pd.read_csv" data-toc-modified-id="pd.read_csv-6.1"><code>pd.read_csv</code></a></span></li><li><span><a href="#Examine-Dataframe-Quickly" data-toc-modified-id="Examine-Dataframe-Quickly-6.2">Examine Dataframe Quickly</a></span></li><li><span><a href="#Examine-DataFrame-Statistically" data-toc-modified-id="Examine-DataFrame-Statistically-6.3">Examine DataFrame Statistically</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#Other-Useful-Functions-to-Examine-DataFrame" data-toc-modified-id="Other-Useful-Functions-to-Examine-DataFrame-6.3.0.1">Other Useful Functions to Examine DataFrame</a></span></li></ul></li></ul></li><li><span><a href="#Examine-DataFrame-with-.groupby" data-toc-modified-id="Examine-DataFrame-with-.groupby-6.4">Examine DataFrame with <code>.groupby</code></a></span></li></ul></li></ul></div>

In [1]:
import pandas as pd

# Documentation

[Pandas Documentation](https://pandas.pydata.org/pandas-docs/stable/) - Keep it handy.





# Intro to Pandas

`Pandas`, a data manipulation and analysis tool built on top of `Numpy`, which name is derived from [Panel Data](https://en.wikipedia.org/wiki/Panel_data)


## Pandas Data Structures

### `pd.Series` and `pd.DataFrame`

Pandas incorporates two additional data structures into Python, namely **Pandas Series** and **Pandas DataFrame**. 
> These data structures allow us to work with **labeled** and **relational** data in an easy and intuitive manner.


## Why Pandas
**Pandas Series** and **DataFrames** are designed for fast data analysis and manipulation, as well as being flexible and easy to use. Below are just a few great features of Pandas:

- Allows the use of labels for rows and columns
- Can calculate rolling statistics on time series data
- Easy handling of `NaN` values
- Able to load data of different formats into DataFrames
- Can join and merge different datasets together
- It integrates with `NumPy` and `Matplotlib`


- How to create Pandas Series and DataFrames using various methods
- How to access and change elements in Series and DataFrames
- How to perform arithmetic operations on Series
- How to load data into a DataFrame
- How to deal with Not a Number (NaN) values

# Pandas Series

Pandas Series differs from Numpy ndarrays in:
- `pd.Series` can hold many data type
- `pd.Series` can assign an index label to each element in the Series.


## Create a Pandas Series

### `pd.Series(data, index)`

In [2]:
data = [30, 6, 'Yes', 'No']
index = ['eggs', 'apples', 'milk', 'bread']
groceries = pd.Series(data, index)
groceries

eggs       30
apples      6
milk      Yes
bread      No
dtype: object

### Attributes of a `pd.Series`

In [3]:
# the shape
print('shape:',groceries.shape)

# the size
print('size:', groceries.size)

# the number of dimension
print('number of dimension:', groceries.ndim)

# the index
print('index:', groceries.index)
# the data
print('data:', groceries.values)

shape: (4,)
size: 4
number of dimension: 1
index: Index(['eggs', 'apples', 'milk', 'bread'], dtype='object')
data: [30 6 'Yes' 'No']

In [4]:
# check if a label in the index
print("Is there banana? -",'banana' in groceries)
print("Is there bread? - ", 'bread' in groceries)

Is there banana? - False
Is there bread? -  True

## Accessing Elements

### By Labelled Index

In [5]:
groceries['eggs']

30

In [6]:
groceries[['eggs', 'bread']]

eggs     30
bread    No
dtype: object

### By Numeric Index

In [7]:
groceries[0]

30

In [8]:
groceries[[0,2]]

eggs     30
milk    Yes
dtype: object

In [9]:
groceries[:2]

eggs      30
apples     6
dtype: object

### `.loc` and `.iloc`

In [10]:
# `.loc` explicitly tells Pandas to use labelled index 
groceries.loc[['eggs', 'apples']]

eggs      30
apples     6
dtype: object

In [11]:
# `.iloc` explicitly tells Pandas to use numeric index 
groceries.iloc[[2,3]]

milk     Yes
bread     No
dtype: object

## Modifying an element
`Series[index]=new_value`

In [12]:
groceries['eggs'] = 20
groceries

eggs       20
apples      6
milk      Yes
bread      No
dtype: object

## Delete an element - `pd.Series.drop` 

`pd.Series.drop(index)` - set parameter `inplace=True` to make change on the original Series

In [13]:
groceries=pd.Series(data, index)
# This won't replace the original pandas Series
print('Modified:\n', groceries.drop('apples'))
print('\nOriginal series remain unchanged:\n', groceries)

Modified:
 eggs      30
milk     Yes
bread     No
dtype: object

Original series remain unchanged:
 eggs       30
apples      6
milk      Yes
bread      No
dtype: object

In [14]:
groceries=pd.Series(data, index)
print('\nOriginal series:\n', groceries)

# This will replace the original pandas Series
groceries.drop('apples', inplace=True)
print('\nOriginal series changed:\n', groceries)

Original series:
 eggs       30
apples      6
milk      Yes
bread      No
dtype: object

Original series changed:
 eggs      30
milk     Yes
bread     No
dtype: object

## Arithmetic Operations

Arithmetic operations on Pandas Series are similar to that on Numpy ndarrays.

### Using arithmetic symbols

In [15]:
fruits= pd.Series(data = [10, 6, 3,], index = ['apples', 'oranges', 'bananas'])
print('Original list of fruits:\n ', fruits)

# using arithmetic symbols
print()
print('fruits + 2:\n', fruits + 2) # We add 2 to each item in fruits
print()
print('fruits - 2:\n', fruits - 2) # We subtract 2 to each item in fruits
print()
print('fruits * 2:\n', fruits * 2) # We multiply each item in fruits by 2 
print()
print('fruits / 2:\n', fruits / 2) # We divide each item in fruits by 2
print()

Original list of fruits:
  apples     10
oranges     6
bananas     3
dtype: int64

fruits + 2:
 apples     12
oranges     8
bananas     5
dtype: int64

fruits - 2:
 apples     8
oranges    4
bananas    1
dtype: int64

fruits * 2:
 apples     20
oranges    12
bananas     6
dtype: int64

fruits / 2:
 apples     5.0
oranges    3.0
bananas    1.5
dtype: float64

In [16]:
groceries = pd.Series(data, index)
print('Original list of grocereis:\n', groceries)
print('\nGroceries * 2:\n', groceries * 2)

Original list of grocereis:
 eggs       30
apples      6
milk      Yes
bread      No
dtype: object

Groceries * 2:
 eggs          60
apples        12
milk      YesYes
bread       NoNo
dtype: object

### Use `Numpy` math functions

In [17]:
import numpy as np
print('Original list of fruits:\n', fruits)

# apply Numpy math functions to all elements of fruits
print()
print('EXP(X) = \n', np.exp(fruits))
print() 
print('SQRT(X) =\n', np.sqrt(fruits))
print()
print('POW(X,2) =\n',np.power(fruits,2))

Original list of fruits:
 apples     10
oranges     6
bananas     3
dtype: int64

EXP(X) =
 apples     22026.465795
oranges      403.428793
bananas       20.085537
dtype: float64

SQRT(X) =
 apples     3.162278
oranges    2.449490
bananas    1.732051
dtype: float64

POW(X,2) =
 apples     100
oranges     36
bananas      9
dtype: int64

# DataFrames

## Create DataFrames - `pd.DataFrame()`

### From a dictionary

#### Using a Dict of Panda Series with Labelled Index

- The keys of the dict will be taken as column names
- The values of the corresponding key will be the column values.
- `NaN` if there is no value for a particular row and column index.
- The columns of the created DataFrame are arranged alphabetically instead of the order given in the dict

In [18]:
items = {'Bob' : pd.Series(data = [245, 25, 55], index = ['bike', 'pants', 'watch']),
         'Alice' : pd.Series(data = [40, 110, 500, 45], index = ['book', 'glasses', 'bike', 'pants'])}

shopping_carts=pd.DataFrame(items)
shopping_carts

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

#### Using a Dict of Pandas Series without Labelled Index

In [19]:
data = {'Bob' : pd.Series([245, 25, 55]),
        'Alice' : pd.Series([40, 110, 500, 45])}


df = pd.DataFrame(data)
df

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

#### Using a Dict of lists without row `index` provided

In [20]:
data = {'Integers' : [1,2,3],
        'Floats' : [4.5, 8.2, 9.6]}

# Create a dataframe without row index
df = pd.DataFrame(data)
df

   Integers  Floats
0         1     4.5
1         2     8.2
2         3     9.6

#### Using a Dict of list with row `index` provided

In [21]:
data = {'Integers' : [1,2,3],
        'Floats' : [4.5, 8.2, 9.6]}

# create a DataFrame and provide the row index
df = pd.DataFrame(data, index = ['label 1', 'label 2', 'label 3'])
df

         Integers  Floats
label 1         1     4.5
label 2         2     8.2
label 3         3     9.6

### From a List of Dicts

In [22]:
# We create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
          {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]


store_items = pd.DataFrame(items2, index = ['store 1', 'store 2'])
store_items

         bikes  pants  watches  glasses
store 1     20     30       35      NaN
store 2     15      5       10     50.0

### From Numpy ndarrays

In [23]:
df = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]),
                   columns=['a', 'b', 'c'])
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

## Attributes of DataFrame

In [24]:
print('shopping_carts has shape:', shopping_carts.shape)
print('shopping_carts has dimension:', shopping_carts.ndim)
print('shopping_carts has a total of:', shopping_carts.size, 'elements\n')
print('The data in shopping_carts is:\n{}', shopping_carts.values,'\n')
print('The row index in shopping_carts is\n:', shopping_carts.index, '\n')
print('The column index in shopping_carts is\n:', shopping_carts.columns)

shopping_carts has shape: (5, 2)
shopping_carts has dimension: 2
shopping_carts has a total of: 10 elements

The data in shopping_carts is:
{} [[245. 500.]
 [ nan  40.]
 [ nan 110.]
 [ 25.  45.]
 [ 55.  nan]]

The row index in shopping_carts is
: Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

The column index in shopping_carts is
: Index(['Bob', 'Alice'], dtype='object')

## Create a DataFrame with Subset of Data

### Subset with `columns`

In [25]:
# Create a DataFrame that only has Bob's data
bob_shopping_cart = pd.DataFrame(items, columns=['Bob'])
bob_shopping_cart

       Bob
bike   245
pants   25
watch   55

### Subset with `index` (rows)

In [26]:
# Create a DataFrame that only has selected items for both Alice and Bob
sel_shopping_cart = pd.DataFrame(items, index = ['pants', 'book'])
sel_shopping_cart

        Bob  Alice
pants  25.0     45
book    NaN     40

### Subset with both `columns` and `index`

In [27]:
# Create a DataFrame that only has selected items for Alice
alice_sel_shopping_cart = pd.DataFrame(items, index = ['glasses', 'bike'], columns = ['Alice'])
alice_sel_shopping_cart

         Alice
glasses    110
bike       500

## Accessing Elements

### Using row labels

In [28]:
store_items.loc[['store 1']]

         bikes  pants  watches  glasses
store 1     20     30       35      NaN

### Using column labels

In [29]:
store_items[['bikes']]

         bikes
store 1     20
store 2     15

In [30]:
store_items[['bikes', 'pants']]

         bikes  pants
store 1     20     30
store 2     15      5

### Using row and column labels

In [31]:
# Column label first, then row label
store_items['bikes']['store 2']

15

In [32]:
# use .loc to access 
# row label first, then column label
store_items.loc['store 2', 'bikes']

15

In [33]:
store_items.loc[['store 2','store 1'], 'bikes']

store 2    15
store 1    20
Name: bikes, dtype: int64

## Adding Columns and Rows


### Adding Columns

#### Using `df[new_col]`

In [34]:
# Adding a column
store_items['shirts'] = [15,2]
store_items

         bikes  pants  watches  glasses  shirts
store 1     20     30       35      NaN      15
store 2     15      5       10     50.0       2

In [35]:
# Add a column by summing other two columns
store_items['suits'] = store_items['pants'] + store_items['shirts']
store_items

         bikes  pants  watches  glasses  shirts  suits
store 1     20     30       35      NaN      15     45
store 2     15      5       10     50.0       2      7

In [36]:
# Add a new column using data from particular rows in the watches column
store_items['new watches'] = store_items['watches'][1:]
store_items

         bikes  pants  watches  glasses  shirts  suits  new watches
store 1     20     30       35      NaN      15     45          NaN
store 2     15      5       10     50.0       2      7         10.0

#### Using `df.insert`

`df.insert(loc, label, data)`

In [37]:
# Insert a new column with label shoes right before 
# the column with numerical index 4
store_items.insert(4, 'shoes', list(np.random.randint(50, size=store_items.shape[0])))
store_items

         bikes  pants  watches  glasses  shoes  shirts  suits  new watches
store 1     20     30       35      NaN      3      15     45          NaN
store 2     15      5       10     50.0     13       2      7         10.0

### Adding Rows

#### Use `df.append`

- first, create a new Dataframe and then 
- append it to the original DataFrame `df.append(new_df)`
- this will return a new df

In [38]:
# create a dictionary 
new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]

# create a new DataFrame with the new_items and provide and index labeled store 3
new_store = pd.DataFrame(new_items, index = ['store 3'])
new_store

         bikes  pants  watches  glasses
store 3     20     30       35        4

In [39]:
# Append store 3 to our store_items DataFrame
store_items = store_items.append(new_store)
store_items

         bikes  pants  watches  glasses  shoes  shirts  suits  new watches
store 1     20     30       35      NaN    3.0    15.0   45.0          NaN
store 2     15      5       10     50.0   13.0     2.0    7.0         10.0
store 3     20     30       35      4.0    NaN     NaN    NaN          NaN

#### Use `df.loc` to assign a new row of data

In [40]:
# Add the rows of items for store 4 and store 5
for i in range (4,6):
    store_items.loc['store {}'.format(i)] = list(np.random.randint(50, size=store_items.shape[1]))
store_items

         bikes  pants  watches  glasses  shoes  shirts  suits  new watches
store 1     20     30       35      NaN    3.0    15.0   45.0          NaN
store 2     15      5       10     50.0   13.0     2.0    7.0         10.0
store 3     20     30       35      4.0    NaN     NaN    NaN          NaN
store 4     18     28        6     34.0   22.0    26.0   38.0         31.0
store 5     14     34        5     15.0    0.0     9.0   23.0         18.0

## Deleting Columns and Rows

### `df.pop` to delete columns

In [41]:
store_items.pop('new watches')
store_items

         bikes  pants  watches  glasses  shoes  shirts  suits
store 1     20     30       35      NaN    3.0    15.0   45.0
store 2     15      5       10     50.0   13.0     2.0    7.0
store 3     20     30       35      4.0    NaN     NaN    NaN
store 4     18     28        6     34.0   22.0    26.0   38.0
store 5     14     34        5     15.0    0.0     9.0   23.0

### `df.drop` to delete both columns and rows

In [42]:
# Remove the watches and shoes columns
store_items.drop(['watches', 'shoes'], axis = 1)

         bikes  pants  glasses  shirts  suits
store 1     20     30      NaN    15.0   45.0
store 2     15      5     50.0     2.0    7.0
store 3     20     30      4.0     NaN    NaN
store 4     18     28     34.0    26.0   38.0
store 5     14     34     15.0     9.0   23.0

In [43]:
# Remove the store 2 and store 1 rows
store_items.drop(['store 2', 'store 1'], axis = 0)

         bikes  pants  watches  glasses  shoes  shirts  suits
store 3     20     30       35      4.0    NaN     NaN    NaN
store 4     18     28        6     34.0   22.0    26.0   38.0
store 5     14     34        5     15.0    0.0     9.0   23.0

## Rename Rows and Columns

### `df.rename`

In [44]:
# Change the row label from store 5 to last store
store_items.rename(index = {'store 5': 'last store'})

            bikes  pants  watches  glasses  shoes  shirts  suits
store 1        20     30       35      NaN    3.0    15.0   45.0
store 2        15      5       10     50.0   13.0     2.0    7.0
store 3        20     30       35      4.0    NaN     NaN    NaN
store 4        18     28        6     34.0   22.0    26.0   38.0
last store     14     34        5     15.0    0.0     9.0   23.0

In [45]:
# Change the column label bikes to hats
store_items.rename(columns = {'bikes': 'hats'})

         hats  pants  watches  glasses  shoes  shirts  suits
store 1    20     30       35      NaN    3.0    15.0   45.0
store 2    15      5       10     50.0   13.0     2.0    7.0
store 3    20     30       35      4.0    NaN     NaN    NaN
store 4    18     28        6     34.0   22.0    26.0   38.0
store 5    14     34        5     15.0    0.0     9.0   23.0

#### `df.set_index` - set the row index with data of a column

In [46]:
# Change the row index to the data of `pants` column
store_items.set_index('pants')

       bikes  watches  glasses  shoes  shirts  suits
pants
30        20       35      NaN    3.0    15.0   45.0
5         15       10     50.0   13.0     2.0    7.0
30        20       35      4.0    NaN     NaN    NaN
28        18        6     34.0   22.0    26.0   38.0
34        14        5     15.0    0.0     9.0   23.0

# Dealing with `NaN`

## Visualize `NaN` 

### `df.isnull`

In [47]:
store_items.isnull()

         bikes  pants  watches  glasses  shoes  shirts  suits
store 1  False  False    False     True  False   False  False
store 2  False  False    False    False  False   False  False
store 3  False  False    False    False   True    True   True
store 4  False  False    False    False  False   False  False
store 5  False  False    False    False  False   False  False

In [48]:
store_items.isnull().sum()

bikes      0
pants      0
watches    0
glasses    1
shoes      1
shirts     1
suits      1
dtype: int64

### `df.count` - do the opposite

In [49]:
store_items.count()

bikes      5
pants      5
watches    5
glasses    4
shoes      4
shirts     4
suits      4
dtype: int64

## Remove `NaN`

### `df.dropna`

In [51]:
# drop rows with `NaN` (by default)
store_items.dropna()

         bikes  pants  watches  glasses  shoes  shirts  suits
store 2     15      5       10     50.0   13.0     2.0    7.0
store 4     18     28        6     34.0   22.0    26.0   38.0
store 5     14     34        5     15.0    0.0     9.0   23.0

In [52]:
store_items.dropna(axis=0)

         bikes  pants  watches  glasses  shoes  shirts  suits
store 2     15      5       10     50.0   13.0     2.0    7.0
store 4     18     28        6     34.0   22.0    26.0   38.0
store 5     14     34        5     15.0    0.0     9.0   23.0

In [54]:
# drop columns with `NaN`
store_items.dropna(axis=1)

         bikes  pants  watches
store 1     20     30       35
store 2     15      5       10
store 3     20     30       35
store 4     18     28        6
store 5     14     34        5

## Replace `NaN`

### `df.fillna`

In [55]:
# replace missing value with 0
store_items.fillna(0)

         bikes  pants  watches  glasses  shoes  shirts  suits
store 1     20     30       35      0.0    3.0    15.0   45.0
store 2     15      5       10     50.0   13.0     2.0    7.0
store 3     20     30       35      4.0    0.0     0.0    0.0
store 4     18     28        6     34.0   22.0    26.0   38.0
store 5     14     34        5     15.0    0.0     9.0   23.0

In [56]:
# replace missing value with the previous value in the column
store_items.fillna(method='ffill', axis=0)

         bikes  pants  watches  glasses  shoes  shirts  suits
store 1     20     30       35      NaN    3.0    15.0   45.0
store 2     15      5       10     50.0   13.0     2.0    7.0
store 3     20     30       35      4.0   13.0     2.0    7.0
store 4     18     28        6     34.0   22.0    26.0   38.0
store 5     14     34        5     15.0    0.0     9.0   23.0

In [57]:
# replace missing value with the previous value in the row
store_items.fillna(method='ffill', axis=1)

         bikes  pants  watches  glasses  shoes  shirts  suits
store 1   20.0   30.0     35.0     35.0    3.0    15.0   45.0
store 2   15.0    5.0     10.0     50.0   13.0     2.0    7.0
store 3   20.0   30.0     35.0      4.0    4.0     4.0    4.0
store 4   18.0   28.0      6.0     34.0   22.0    26.0   38.0
store 5   14.0   34.0      5.0     15.0    0.0     9.0   23.0

In [59]:
# replace missing value with the next value in the column
store_items.fillna(method='backfill', axis=0)

         bikes  pants  watches  glasses  shoes  shirts  suits
store 1     20     30       35     50.0    3.0    15.0   45.0
store 2     15      5       10     50.0   13.0     2.0    7.0
store 3     20     30       35      4.0   22.0    26.0   38.0
store 4     18     28        6     34.0   22.0    26.0   38.0
store 5     14     34        5     15.0    0.0     9.0   23.0

### `df.interpolate`

In [61]:
# Replace missing values using linear interpolated column values
store_items.interpolate(method = 'linear', axis=0)

         bikes  pants  watches  glasses  shoes  shirts  suits
store 1     20     30       35      NaN    3.0    15.0   45.0
store 2     15      5       10     50.0   13.0     2.0    7.0
store 3     20     30       35      4.0   17.5    14.0   22.5
store 4     18     28        6     34.0   22.0    26.0   38.0
store 5     14     34        5     15.0    0.0     9.0   23.0

In [62]:
store_items.interpolate(method = 'linear', axis = 1)

         bikes  pants  watches  glasses  shoes  shirts  suits
store 1   20.0   30.0     35.0     19.0    3.0    15.0   45.0
store 2   15.0    5.0     10.0     50.0   13.0     2.0    7.0
store 3   20.0   30.0     35.0      4.0    4.0     4.0    4.0
store 4   18.0   28.0      6.0     34.0   22.0    26.0   38.0
store 5   14.0   34.0      5.0     15.0    0.0     9.0   23.0

## Quiz - Create and Clean a DataFrame

In [63]:
import pandas as pd
import numpy as np

# Since we will be working with ratings, we will set the precision of our 
# dataframes to one decimal place.
pd.set_option('precision', 1)

# Create a Pandas DataFrame that contains the ratings some users have given to a
# series of books. The ratings given are in the range from 1 to 5, with 5 being
# the best score. The names of the books, the authors, and the ratings of each user
# are given below:

books = pd.Series(data = ['Great Expectations', 'Of Mice and Men', 'Romeo and Juliet', 'The Time Machine', 'Alice in Wonderland' ])
authors = pd.Series(data = ['Charles Dickens', 'John Steinbeck', 'William Shakespeare', ' H. G. Wells', 'Lewis Carroll' ])

user_1 = pd.Series(data = [3.2, np.nan ,2.5])
user_2 = pd.Series(data = [5., 1.3, 4.0, 3.8])
user_3 = pd.Series(data = [2.0, 2.3, np.nan, 4])
user_4 = pd.Series(data = [4, 3.5, 4, 5, 4.2])

# Users that have np.nan values means that the user has not yet rated that book.
# Use the data above to create a Pandas DataFrame that has the following column
# labels: 'Author', 'Book Title', 'User 1', 'User 2', 'User 3', 'User 4'. Let Pandas
# automatically assign numerical row indices to the DataFrame. 

# Create a dictionary with the data given above
dat = {'Author': authors,
       'Book Title': books,
       'User 1': user_1,
       'User 2': user_2,
       'User 3': user_3,
       'User 4': user_4}


# Use the dictionary to create a Pandas DataFrame
book_ratings = pd.DataFrame(dat)

# If you created the dictionary correctly you should have a Pandas DataFrame
# that has column labels: 'Author', 'Book Title', 'User 1', 'User 2', 'User 3',
# 'User 4' and row indices 0 through 4.
book_ratings

                Author           Book Title  User 1  User 2  User 3  User 4
0      Charles Dickens   Great Expectations     3.2     5.0     2.0     4.0
1       John Steinbeck      Of Mice and Men     NaN     1.3     2.3     3.5
2  William Shakespeare     Romeo and Juliet     2.5     4.0     NaN     4.0
3          H. G. Wells     The Time Machine     NaN     3.8     4.0     5.0
4        Lewis Carroll  Alice in Wonderland     NaN     NaN     NaN     4.2

In [74]:
# Now replace all the NaN values in your DataFrame with the average rating in
# each column. Replace the NaN values in place. HINT: you can use the fillna()
# function with the keyword inplace = True, to do this. Write your code below:
print(book_ratings.mean())
book_ratings.fillna(book_ratings.mean(), axis=0, inplace=True)
book_ratings

User 1    2.9
User 2    3.5
User 3    2.8
User 4    4.1
dtype: float64

                Author           Book Title  User 1  User 2  User 3  User 4
0      Charles Dickens   Great Expectations     3.2     5.0     2.0     4.0
1       John Steinbeck      Of Mice and Men     2.9     1.3     2.3     3.5
2  William Shakespeare     Romeo and Juliet     2.5     4.0     2.8     4.0
3          H. G. Wells     The Time Machine     2.9     3.8     4.0     5.0
4        Lewis Carroll  Alice in Wonderland     2.9     3.5     2.8     4.2

In [78]:
# Select the book titles with any user rating == 5
book_ratings[(book_ratings == 5).any(axis = 1)]['Book Title'].values

array(['Great Expectations', 'The Time Machine'], dtype=object)

# Loading Data into DataFrame

## `pd.read_csv`

In [82]:
Google_stock = pd.read_csv('scripts/goog-1.csv')
print('Google_stock has shape:', Google_stock.shape)

Google_stock has shape: (3313, 7)

## Examine Dataframe Quickly

In [83]:
Google_stock.head()

         Date  Open  High   Low  Close  Adj Close    Volume
0  2004-08-19  49.7  51.7  47.7   49.8       49.8  44994500
1  2004-08-20  50.2  54.2  49.9   53.8       53.8  23005800
2  2004-08-23  55.0  56.4  54.2   54.3       54.3  18393200
3  2004-08-24  55.3  55.4  51.5   52.1       52.1  15361800
4  2004-08-25  52.1  53.7  51.6   52.7       52.7   9257400

In [84]:
Google_stock.tail()

            Date   Open   High    Low  Close  Adj Close   Volume
3308  2017-10-09  980.0  985.4  976.1  977.0      977.0   891400
3309  2017-10-10  980.0  981.6  966.1  972.6      972.6   968400
3310  2017-10-11  973.7  990.7  972.2  989.2      989.2  1693300
3311  2017-10-12  987.5  994.1  985.0  987.8      987.8  1262400
3312  2017-10-13  992.0  997.2  989.0  989.7      989.7  1157700

In [85]:
# to check if any NaN
Google_stock.isnull().any()

Date         False
Open         False
High         False
Low          False
Close        False
Adj Close    False
Volume       False
dtype: bool

#### Other Useful Functions to Examine DataFrame

- `df.columns`
- `df.info()`
- `df['column_name'].value_counts()`
- `df['column_name'].unique()`

## Examine DataFrame Statistically

In [86]:
# get descriptive statistics
Google_stock.describe()

         Open    High     Low   Close  Adj Close   Volume
count  3313.0  3313.0  3313.0  3313.0     3313.0  3.3e+03
mean    380.2   383.5   376.5   380.1      380.1  8.0e+06
std     223.8   225.0   222.5   223.9      223.9  8.4e+06
min      49.3    50.5    47.7    49.7       49.7  7.9e+03
25%     226.6   228.4   224.0   226.4      226.4  2.6e+06
50%     293.3   295.4   289.9   293.0      293.0  5.3e+06
75%     536.7   540.0   532.4   536.7      536.7  1.1e+07
max     992.0   997.2   989.0   989.7      989.7  8.3e+07

In [87]:
# get descriptive statistics on selected columns
Google_stock['Adj Close'].describe()

count    3313.0
mean      380.1
std       223.9
min        49.7
25%       226.4
50%       293.0
75%       536.7
max       989.7
Name: Adj Close, dtype: float64

In [93]:
# Use math function to look up one stat
print('Maximum values of each column:\n', Google_stock.max(), '\n')
print('Minimum Close value:', Google_stock['Close'].min(), '\n')
print('Average value of each column:\n', Google_stock.mean())

Maximum values of each column:
 Date         2017-10-13
Open              1e+03
High              1e+03
Low               1e+03
Close             1e+03
Adj Close         1e+03
Volume         82768100
dtype: object

Minimum Close value: 49.681866

Average value of each column:
 Open         3.8e+02
High         3.8e+02
Low          3.8e+02
Close        3.8e+02
Adj Close    3.8e+02
Volume       8.0e+06
dtype: float64

In [94]:
# data correlations between columns
Google_stock.corr()

           Open  High  Low  Close  Adj Close  Volume
Open        1.0   1.0  1.0    1.0        1.0    -0.6
High        1.0   1.0  1.0    1.0        1.0    -0.6
Low         1.0   1.0  1.0    1.0        1.0    -0.6
Close       1.0   1.0  1.0    1.0        1.0    -0.6
Adj Close   1.0   1.0  1.0    1.0        1.0    -0.6
Volume     -0.6  -0.6 -0.6   -0.6       -0.6     1.0

## Examine DataFrame with `.groupby`

In [96]:
data = pd.read_csv('scripts/fake_company.csv', delimiter='\t')
data

   Year     Name Department  Age  Salary
0  1990    Alice         HR   25   50000
1  1990      Bob         RD   30   48000
2  1990  Charlie      Admin   45   55000
3  1991    Alice         HR   26   52000
4  1991      Bob         RD   31   50000
5  1991  Charlie      Admin   46   60000
6  1992    Alice      Admin   27   60000
7  1992      Bob         RD   32   52000
8  1992  Charlie      Admin   28   62000

In [98]:
data.groupby(['Year'])['Salary'].sum()

Year
1990    153000
1991    162000
1992    174000
Name: Salary, dtype: int64

In [99]:
data.groupby(['Year'])['Salary'].mean()

Year
1990    51000
1991    54000
1992    58000
Name: Salary, dtype: int64

In [100]:
data.groupby(['Name'])['Salary'].sum()

Name
Alice      162000
Bob        150000
Charlie    177000
Name: Salary, dtype: int64

In [101]:
data.groupby(['Year', 'Department'])['Salary'].sum()

Year  Department
1990  Admin          55000
      HR             50000
      RD             48000
1991  Admin          60000
      HR             52000
      RD             50000
1992  Admin         122000
      RD             52000
Name: Salary, dtype: int64